app/controllers/home_controller.rb

INSERT INTO "posts" ("myname", "mymajor1", "mymajor2", "mygrade", "myclub", "myclubjoin", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?, ?, ?, ?)
---
  def write

      new_post = Post.new
      new_post.myname = params[:myname]
      new_post.mymajor1 = params[:mymajor1]
      new_post.mymajor2 = params[:mymajor2]
      new_post.mygrade = params[:mygrade]
      new_post.myclub = params[:myclub]
      new_post.myclubjoin = params[:myclubjoin]

      new_post.save

SELECT "posts".* FROM "posts"  ORDER BY id desc
---
  def list
      @every_post = Post.all.order("id desc")